---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntryError
source: html/045029df-f8bd-d8df-e5bb-df840012d804.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryError

This class contains information about a problem encountered while creating a KeyBasedTreeEntries object.

## Syntax (C#)
```csharp
public class KeyBasedTreeEntryError : IDisposable
```

## Remarks
This problem might be a duplicate entry, or an error in the
 specified parent-child relationships, or something else. See BuiltInKeyBasedTreeEntryErrorType for details.